Tekla.Structures.Catalogs.ParametricProfileItem
The ParametricProfileItem class contains information from parametric profiles in
the catalog. Parametric profile items can be enumerated using a profile item enumerator.
It is possible to select a parametric profile item by its name:
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
ParametricProfileItem ParametricProfileItem = new ParametricProfileItem();
ParametricProfileItem.ProfilePrefix = "PHI";
ParametricProfileItem.Select();
}
}

Tekla.Structures.Catalogs.ParametricProfileItem.#ctor
Creates a new parametric profile item instance.

Tekla.Structures.Catalogs.ParametricProfileItem.ProfilePrefix
The parametric profile item prefix.

Tekla.Structures.Catalogs.ParametricProfileItem.GetParametricProfilePrefix(System.Int32)
Gets the parametric profile item prefix using the given subtype. This can be used
after retrieving a library profile that has a parametric user-defined type.
Subtype: The profile item subtype.
Returns: The parametric profile item prefix.

Tekla.Structures.Catalogs.ParametricProfileItem.CreateProfileString
Gets the parametric profile item prefix and adds parameter values.
Returns: The parametric profile string with parameter values in millimeters.

Tekla.Structures.Catalogs.ParametricProfileItem.Select(System.String)
Selects the parametric profile item in the profile database using the given name.
ProfileName: The name of the profile to select.
Returns: True on success.

Tekla.Structures.Catalogs.ParametricProfileItem.GetListOfParameters(System.String)
Gets the parameters from the ParameterString.

Tekla.Structures.Catalogs.ParametricProfileItem.UseImperialUnits
Gets the imperial setting.